In [2]:
import pandas as pd

In [2]:
# Data structures supported by Pandas:
# Series, Dataframes

In [4]:
s1 = pd.Series([3, 5, 8, 2, 7, 4, 1])
s1, type(s1)

(0    3
 1    5
 2    8
 3    2
 4    7
 5    4
 6    1
 dtype: int64,
 pandas.core.series.Series)

In [5]:
s2 = pd.Series([5, 3, 7], index=['a', 'b', 'c'])
s2

a    5
b    3
c    7
dtype: int64

In [6]:
s3 = pd.Series({ 'a': 5, 'b': 3, 'c': 7 })
s3

a    5
b    3
c    7
dtype: int64

In [7]:
# From scalar values
s4 = pd.Series(4, index=['a', 'b', 'c', 'd'])
s4

a    4
b    4
c    4
d    4
dtype: int64

In [16]:
s2['a']
s2[['a', 'b']]
s2.loc[['a', 'c']]

a    5
c    7
dtype: int64

In [13]:
s1[s1 > 5]

2    8
4    7
dtype: int64

In [25]:
s1.index

0

In [41]:
s1.values
s1.describe()

count    7.000000
mean     4.285714
std      2.563480
min      1.000000
25%      2.500000
50%      4.000000
75%      6.000000
max      8.000000
dtype: float64

In [45]:
for item in s2.items():
  print(item)

('a', 5)
('b', 3)
('c', 7)

In [29]:
s2.astype(float)

a    5.0
b    3.0
c    7.0
dtype: float64

In [47]:
series = pd.Series([4, 5, 62, 1])
series.sum() # OR sum(series)
series.max()

62

In [63]:
s = pd.Series(['a', 'b', 'c', 'b', 'a'])
s.value_counts().c

1

In [1]:
# WAP to create a list and take a element input from user and 
# Check if the specific value is present in a Series.

s = pd.Series([4, 5, 62, 1])

int(input()) in s.values

NameError: name 'pd' is not defined

In [11]:
# 1. Find the top N largest values in a Series
s = pd.Series([3, 6, 1, 7, 8, 24])
s.nlargest(3)

5    24
4     8
3     7
dtype: int64

In [12]:
# 2. Check if all elements in a Series are unique

s.is_unique   # Or len(s.unique()) == len(s)

True

### Dataframes

In [70]:
data = {
  'Name': ['Chima', 'Anish', 'Ebuka', 'Esther'],
  'Age': [23, 25, 21, 42],
  'City': ['Lagos', 'New Delhi', 'Aba', 'New York']
}

# data = [{'Name': 'Alice', 'Age': 25, 'City': 'New York'},
#         {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
#         {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'},
#         {'Name': 'David', 'Age': 40, 'City': 'Houston'}]

d1 = pd.DataFrame(data)
d1

     Name  Age       City
0   Chima   23      Lagos
1   Anish   25  New Delhi
2   Ebuka   21        Aba
3  Esther   42   New York

In [71]:
d1['Name']
d1.loc[0]
d1.iloc[1]

Name        Anish
Age            25
City    New Delhi
Name: 1, dtype: object

In [72]:
d1.shape

(4, 3)

In [73]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [74]:
d1[d1['Age'] > 24]

     Name  Age       City
1   Anish   25  New Delhi
3  Esther   42   New York

In [75]:
d1.sort_values(by='Age', ascending=False) # Indexes will be in place
# d1.reset_index(inplace=True)

     Name  Age       City
3  Esther   42   New York
1   Anish   25  New Delhi
0   Chima   23      Lagos
2   Ebuka   21        Aba

In [76]:
# d1.drop('index', inplace=True)
d1

     Name  Age       City
0   Chima   23      Lagos
1   Anish   25  New Delhi
2   Ebuka   21        Aba
3  Esther   42   New York

In [77]:
d1['Salary'] = pd.Series([4000, 6000, 2000, 24,000])
d1

     Name  Age       City  Salary
0   Chima   23      Lagos    4000
1   Anish   25  New Delhi    6000
2   Ebuka   21        Aba    2000
3  Esther   42   New York      24

In [95]:
new_row = pd.DataFrame({'Name': ['Bob', 'David'], 'Age': [30, 26], 'City': ['Los Angeles', 'Lagos']})

d1 = pd.concat([d1, new_row], ignore_index=True) # ignore_index=True creates new index for the new row

d1

     Name  Age         City  Compensation
0   Chima   23        Lagos       60000.0
1   Anish   25    New Delhi       90000.0
2   Ebuka   21          Aba       30000.0
3  Esther   42     New York         360.0
4     Bob   30  Los Angeles           NaN
5     Bob   30  Los Angeles           NaN
6   David   26        Lagos           NaN

In [79]:
# Update an entire column

d1.Salary = d1.Salary * 1.5
d1

     Name  Age         City  Salary
0   Chima   23        Lagos  6000.0
1   Anish   25    New Delhi  9000.0
2   Ebuka   21          Aba  3000.0
3  Esther   42     New York    36.0
4     Bob   30  Los Angeles     NaN

In [85]:
# Rename a column

d1.rename(columns = { 'Payment': 'Compensation' }, inplace=True)
d1

     Name  Age         City  Compensation
0   Chima   23        Lagos        6000.0
1   Anish   25    New Delhi        9000.0
2   Ebuka   21          Aba        3000.0
3  Esther   42     New York          36.0
4     Bob   30  Los Angeles           NaN

In [86]:
d1.Compensation = d1.Compensation * 10
d1

     Name  Age         City  Compensation
0   Chima   23        Lagos       60000.0
1   Anish   25    New Delhi       90000.0
2   Ebuka   21          Aba       30000.0
3  Esther   42     New York         360.0
4     Bob   30  Los Angeles           NaN

In [88]:
d1[d1['Compensation'] > 25000]

    Name  Age       City  Compensation
0  Chima   23      Lagos       60000.0
1  Anish   25  New Delhi       90000.0
2  Ebuka   21        Aba       30000.0

In [94]:
d1.sort_values('Age', ascending=False)

     Name  Age         City  Compensation
3  Esther   42     New York         360.0
4     Bob   30  Los Angeles           NaN
1   Anish   25    New Delhi       90000.0
0   Chima   23        Lagos       60000.0
2   Ebuka   21          Aba       30000.0

In [2]:
# Grouping

city_groups = d1.groupby('City')

city_groups.sum('Salary')
city_groups.max('Age')
city_groups.mean()

In [ ]:
# https://www.w3resource.com/python-exercises/pandas/index.php

### Exploratory Data Analysis

In [3]:
import pandas as pd

In [7]:
coffee_sales = pd.read_csv('coffee_sales.csv')
# coffee_sales.head(7)
coffee_sales.tail()

,Unnamed: 0,Area Code,Cogs,DifferenceBetweenActualandTargetProfit,Date,Inventory Margin,Margin,Market_size,Market,Marketing,...,Product,Profit,Sales,State,Target_cogs,Target_margin,Target_profit,Target_sales,Total_expenses,Type
1057,1057,775,250,133,8/23/2015,1820,251,Small Market,North Asia,70,...,Earl Grey,233,534,Nevada,180,180,100,360,94,Regular
1058,1058,971,88,48,8/24/2015,817,133,Small Market,North Asia,29,...,Earl Grey,108,236,Oregon,60,100,60,160,60,Regular
1059,1059,775,294,-285,8/25/2015,8252,-294,Small Market,North Asia,111,...,Green Tea,-605,33,Nevada,210,-210,-320,0,145,Regular
1060,1060,503,134,80,8/26/2015,690,186,Small Market,North Asia,41,...,Green Tea,180,341,Oregon,90,140,100,230,65,Regular
1061,1061,435,20,-22,8/27/2015,218,25,Small Market,North Asia,7,...,Green Tea,-22,48,Utah,10,20,0,30,40,Regular

In [10]:
coffee_sales.shape

(1062, 22)

In [12]:
coffee_sales.columns

Index(['Unnamed: 0', 'Area Code', 'Cogs',
       'DifferenceBetweenActualandTargetProfit', 'Date', 'Inventory Margin',
       'Margin', 'Market_size', 'Market', 'Marketing', 'Product_line',
       'Product_type', 'Product', 'Profit', 'Sales', 'State', 'Target_cogs',
       'Target_margin', 'Target_profit', 'Target_sales ', 'Total_expenses',
       'Type'],
      dtype='object')

In [13]:
coffee_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1062 entries, 0 to 1061
Data columns (total 22 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   Unnamed: 0                              1062 non-null   int64
 1   Area Code                               1062 non-null   int64
 2   Cogs                                    1062 non-null   int64
 3   DifferenceBetweenActualandTargetProfit  1062 non-null   int64
 4   Date                                    1062 non-null   object
 5   Inventory Margin                        1062 non-null   int64
 6   Margin                                  1062 non-null   int64
 7   Market_size                             1062 non-null   object
 8   Market                                  1062 non-null   object
 9   Marketing                               1062 non-null   int64
 10  Product_line                            1062 non-null   object
 11  Product_type                            1062 non-null   object
 12  Product                                 1062 non-null   object
 13  Profit                                  1062 non-null   int64
 14  Sales                                   1062 non-null   int64
 15  State                                   1062 non-null   object
 16  Target_cogs                             1062 non-null   int64
 17  Target_margin                           1062 non-null   int64
 18  Target_profit                           1062 non-null   int64
 19  Target_sales                            1062 non-null   int64
 20  Total_expenses                          1062 non-null   int64
 21  Type                                    1062 non-null   object
dtypes: int64(14), object(8)
memory usage: 182.7+ KB

In [15]:
# Check for null values

coffee_sales.isnull()

,Unnamed: 0,Area Code,Cogs,DifferenceBetweenActualandTargetProfit,Date,Inventory Margin,Margin,Market_size,Market,Marketing,...,Product,Profit,Sales,State,Target_cogs,Target_margin,Target_profit,Target_sales,Total_expenses,Type
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1057,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1058,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1059,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1060,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1061,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [17]:
coffee_sales.isnull().sum()

Unnamed: 0                                0
Area Code                                 0
Cogs                                      0
DifferenceBetweenActualandTargetProfit    0
Date                                      0
Inventory Margin                          0
Margin                                    0
Market_size                               0
Market                                    0
Marketing                                 0
Product_line                              0
Product_type                              0
Product                                   0
Profit                                    0
Sales                                     0
State                                     0
Target_cogs                               0
Target_margin                             0
Target_profit                             0
Target_sales                              0
Total_expenses                            0
Type                                      0
dtype: int64

In [21]:
# Access rows where values are null

coffee_sales[coffee_sales.isnull().any(axis=1)]

Empty DataFrame
Columns: [Unnamed: 0, Area Code, Cogs, DifferenceBetweenActualandTargetProfit, Date, Inventory Margin, Margin, Market_size, Market, Marketing, Product_line, Product_type, Product, Profit, Sales, State, Target_cogs, Target_margin, Target_profit, Target_sales , Total_expenses, Type]
Index: []

[0 rows x 22 columns]

In [32]:
# Get the percentage of missing data

# coffee_sales.isnull().sum() / len(coffee_sales) * 100

total_null = len(coffee_sales[coffee_sales.isnull().any(axis=1)])
total = len(coffee_sales)

total_null / total * 100

0.0

In [39]:
coffee_sales.describe() # Works for numeric cols only
# coffee_sales.describe().mean()

,Unnamed: 0,Area Code,Cogs,DifferenceBetweenActualandTargetProfit,Inventory Margin,Margin,Marketing,Profit,Sales,Target_cogs,Target_margin,Target_profit,Target_sales,Total_expenses
count,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000,1062.000000
mean,530.500000,587.030132,82.399247,0.387006,815.175141,102.423729,30.433145,60.556497,191.049906,71.676083,96.817326,60.169492,168.493409,53.836158
std,306.717297,225.299162,64.824295,44.331180,916.156386,91.286704,25.963448,100.516593,148.270317,65.701583,89.467176,77.824869,145.955171,31.703526
min,0.000000,203.000000,0.000000,-369.000000,-3534.000000,-294.000000,0.000000,-605.000000,21.000000,0.000000,-210.000000,-320.000000,0.000000,11.000000
25%,265.250000,425.000000,41.000000,-15.000000,447.000000,51.000000,13.000000,16.250000,98.000000,30.000000,50.000000,20.000000,80.000000,33.000000
50%,530.500000,573.000000,57.000000,-3.000000,659.000000,73.000000,22.000000,39.500000,133.000000,50.000000,70.000000,40.000000,120.000000,46.000000
75%,795.750000,774.000000,101.000000,13.000000,968.000000,130.000000,40.750000,87.000000,227.000000,90.000000,120.000000,80.000000,210.000000,66.000000
max,1061.000000,985.000000,294.000000,249.000000,8252.000000,526.000000,122.000000,646.000000,815.000000,380.000000,580.000000,470.000000,960.000000,156.000000

In [41]:
coffee_sales.describe(include='object')   # For text/categoretical columns only

,Date,Market_size,Market,Product_line,Product_type,Product,State,Type
count,1062,1062,1062,1062,1062,1062,1062,1062
unique,1061,2,4,2,4,13,20,2
top,10/1/2012,Small Market,Central Asia,Beans,Espresso,Lemon,California,Regular
freq,2,636,336,558,294,120,72,600

#### Treating missing values

In [44]:
# Dropping nulls
coffee_sales.dropna(inplace=True)

In [ ]:
# https://towardsdatascience.com/exploratory-data-analysis-in-python-a-step-by-step-process-d0dfa6bf94ee